In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [3]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [5]:
np.random.seed(1)
s2 = pd.Series(np.random.randint(6, size=100))
s2.tail()

95    4
96    5
97    2
98    4
99    3
dtype: int32

In [6]:
s2.value_counts()

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

In [11]:
titanic.sort_values([], axis=1)

,parch,adult_male,alone,survived,sibsp,pclass,age,fare,deck,class,embarked,embark_town,sex,who,alive
0,0,True,False,0,1,3,22.0,7.2500,NaN,Third,S,Southampton,male,man,no
1,0,False,False,1,1,1,38.0,71.2833,C,First,C,Cherbourg,female,woman,yes
2,0,False,True,1,0,3,26.0,7.9250,NaN,Third,S,Southampton,female,woman,yes
3,0,False,False,1,1,1,35.0,53.1000,C,First,S,Southampton,female,woman,yes
4,0,True,True,0,0,3,35.0,8.0500,NaN,Third,S,Southampton,male,man,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,True,True,0,0,2,27.0,13.0000,NaN,Second,S,Southampton,male,man,no
887,0,False,True,1,0,1,19.0,30.0000,B,First,S,Southampton,female,woman,yes
888,2,False,False,0,1,3,NaN,23.4500,NaN,Third,S,Southampton,female,woman,no
889,0,True,True,1,0,1,26.0,30.0000,C,First,C,Cherbourg,male,man,yes
890,0,True,True,0,0,3,32.0,7.7500,NaN,Third,Q,Queenstown,male,man,no